stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba5mxx.h
/********************  Bit definition for PWR_IORETRA register  *****************/
#define PWR_IORETRA_RET0_Pos                (0UL)
#define PWR_IORETRA_RET0_Msk                (0x1UL << PWR_IORETRA_RET0_Pos)            /*!< 0x00000001 */
#define PWR_IORETRA_RET0                    PWR_IORETRA_RET0_Msk                       /*!< Standby GPIO retention status for PA0  */
#define PWR_IORETRA_RET1_Pos                (1UL)
#define PWR_IORETRA_RET1_Msk                (0x1UL << PWR_IORETRA_RET1_Pos)            /*!< 0x00000002 */
#define PWR_IORETRA_RET1                    PWR_IORETRA_RET1_Msk                       /*!< Standby GPIO retention status for PA1  */
#define PWR_IORETRA_RET2_Pos                (2UL)
#define PWR_IORETRA_RET2_Msk                (0x1UL << PWR_IORETRA_RET2_Pos)            /*!< 0x00000004 */
#define PWR_IORETRA_RET2                    PWR_IORETRA_RET2_Msk                       /*!< Standby GPIO retention status for PA2  */
#define PWR_IORETRA_RET3_Pos                (3UL)
#define PWR_IORETRA_RET3_Msk                (0x1UL << PWR_IORETRA_RET3_Pos)            /*!< 0x00000008 */
#define PWR_IORETRA_RET3                    PWR_IORETRA_RET3_Msk                       /*!< Standby GPIO retention status for PA3  */
#define PWR_IORETRA_RET4_Pos                (4UL)
#define PWR_IORETRA_RET4_Msk                (0x1UL << PWR_IORETRA_RET4_Pos)            /*!< 0x00000010 */
#define PWR_IORETRA_RET4                    PWR_IORETRA_RET4_Msk                       /*!< Standby GPIO retention status for PA4  */
#define PWR_IORETRA_RET5_Pos                (5UL)
#define PWR_IORETRA_RET5_Msk                (0x1UL << PWR_IORETRA_RET5_Pos)            /*!< 0x00000020 */
#define PWR_IORETRA_RET5                    PWR_IORETRA_RET5_Msk                       /*!< Standby GPIO retention status for PA5  */
#define PWR_IORETRA_RET6_Pos                (6UL)
#define PWR_IORETRA_RET6_Msk                (0x1UL << PWR_IORETRA_RET6_Pos)            /*!< 0x00000040 */
#define PWR_IORETRA_RET6                    PWR_IORETRA_RET6_Msk                       /*!< Standby GPIO retention status for PA6  */
#define PWR_IORETRA_RET7_Pos                (7UL)
#define PWR_IORETRA_RET7_Msk                (0x1UL << PWR_IORETRA_RET7_Pos)            /*!< 0x00000080 */
#define PWR_IORETRA_RET7                    PWR_IORETRA_RET7_Msk                       /*!< Standby GPIO retention status for PA7  */
#define PWR_IORETRA_RET8_Pos                (8UL)
#define PWR_IORETRA_RET8_Msk                (0x1UL << PWR_IORETRA_RET8_Pos)            /*!< 0x00000100 */
#define PWR_IORETRA_RET8                    PWR_IORETRA_RET8_Msk                       /*!< Standby GPIO retention status for PA8  */
#define PWR_IORETRA_RET9_Pos                (9UL)
#define PWR_IORETRA_RET9_Msk                (0x1UL << PWR_IORETRA_RET9_Pos)            /*!< 0x00000200 */
#define PWR_IORETRA_RET9                    PWR_IORETRA_RET9_Msk                       /*!< Standby GPIO retention status for PA9  */
#define PWR_IORETRA_RET10_Pos               (10UL)
#define PWR_IORETRA_RET10_Msk               (0x1UL << PWR_IORETRA_RET10_Pos)           /*!< 0x00000400 */
#define PWR_IORETRA_RET10                   PWR_IORETRA_RET10_Msk                      /*!< Standby GPIO retention status for PA10 */
#define PWR_IORETRA_RET11_Pos               (11UL)
#define PWR_IORETRA_RET11_Msk               (0x1UL << PWR_IORETRA_RET11_Pos)           /*!< 0x00000800 */
#define PWR_IORETRA_RET11                   PWR_IORETRA_RET11_Msk                      /*!< Standby GPIO retention status for PA11 */
#define PWR_IORETRA_RET12_Pos               (12UL)
#define PWR_IORETRA_RET12_Msk               (0x1UL << PWR_IORETRA_RET12_Pos)           /*!< 0x00001000 */
#define PWR_IORETRA_RET12                   PWR_IORETRA_RET12_Msk                      /*!< Standby GPIO retention status for PA12 */
#define PWR_IORETRA_RET13_Pos               (13UL)
#define PWR_IORETRA_RET13_Msk               (0x1UL << PWR_IORETRA_RET13_Pos)           /*!< 0x00002000 */
#define PWR_IORETRA_RET13                   PWR_IORETRA_RET13_Msk                      /*!< Standby GPIO retention status for PA13 */
#define PWR_IORETRA_RET14_Pos               (14UL)
#define PWR_IORETRA_RET14_Msk               (0x1UL << PWR_IORETRA_RET14_Pos)           /*!< 0x00004000 */
#define PWR_IORETRA_RET14                   PWR_IORETRA_RET14_Msk                      /*!< Standby GPIO retention status for PA14 */
#define PWR_IORETRA_RET15_Pos               (15UL)
#define PWR_IORETRA_RET15_Msk               (0x1UL << PWR_IORETRA_RET15_Pos)           /*!< 0x00008000 */
#define PWR_IORETRA_RET15                   PWR_IORETRA_RET15_Msk                      /*!< Standby GPIO retention status for PA15 */

/********************  Bit definition for PWR_IORETENRB register  *****************/
#define PWR_IORETENRB_EN0_Pos               (0UL)
#define PWR_IORETENRB_EN0_Msk               (0x1UL << PWR_IORETENRB_EN0_Pos)           /*!< 0x00000001 */
#define PWR_IORETENRB_EN0                   PWR_IORETENRB_EN0_Msk                      /*!< Standby GPIO retention enable for PB0  */
#define PWR_IORETENRB_EN1_Pos               (1UL)
#define PWR_IORETENRB_EN1_Msk               (0x1UL << PWR_IORETENRB_EN1_Pos)           /*!< 0x00000002 */
#define PWR_IORETENRB_EN1                   PWR_IORETENRB_EN1_Msk                      /*!< Standby GPIO retention enable for PB1  */
#define PWR_IORETENRB_EN2_Pos               (2UL)
#define PWR_IORETENRB_EN2_Msk               (0x1UL << PWR_IORETENRB_EN2_Pos)           /*!< 0x00000004 */
#define PWR_IORETENRB_EN2                   PWR_IORETENRB_EN2_Msk                      /*!< Standby GPIO retention enable for PB2  */
#define PWR_IORETENRB_EN3_Pos               (3UL)
#define PWR_IORETENRB_EN3_Msk               (0x1UL << PWR_IORETENRB_EN3_Pos)           /*!< 0x00000008 */
#define PWR_IORETENRB_EN3                   PWR_IORETENRB_EN3_Msk                      /*!< Standby GPIO retention enable for PB3  */
#define PWR_IORETENRB_EN4_Pos               (4UL)
#define PWR_IORETENRB_EN4_Msk               (0x1UL << PWR_IORETENRB_EN4_Pos)           /*!< 0x00000010 */
#define PWR_IORETENRB_EN4                   PWR_IORETENRB_EN4_Msk                      /*!< Standby GPIO retention enable for PB4  */
#define PWR_IORETENRB_EN5_Pos               (5UL)
#define PWR_IORETENRB_EN5_Msk               (0x1UL << PWR_IORETENRB_EN5_Pos)           /*!< 0x00000020 */
#define PWR_IORETENRB_EN5                   PWR_IORETENRB_EN5_Msk                      /*!< Standby GPIO retention enable for PB5  */
#define PWR_IORETENRB_EN6_Pos               (6UL)
#define PWR_IORETENRB_EN6_Msk               (0x1UL << PWR_IORETENRB_EN6_Pos)           /*!< 0x00000040 */
#define PWR_IORETENRB_EN6                   PWR_IORETENRB_EN6_Msk                      /*!< Standby GPIO retention enable for PB6  */
#define PWR_IORETENRB_EN7_Pos               (7UL)
#define PWR_IORETENRB_EN7_Msk               (0x1UL << PWR_IORETENRB_EN7_Pos)           /*!< 0x00000080 */
#define PWR_IORETENRB_EN7                   PWR_IORETENRB_EN7_Msk                      /*!< Standby GPIO retention enable for PB7  */
#define PWR_IORETENRB_EN8_Pos               (8UL)
#define PWR_IORETENRB_EN8_Msk               (0x1UL << PWR_IORETENRB_EN8_Pos)           /*!< 0x00000100 */
#define PWR_IORETENRB_EN8                   PWR_IORETENRB_EN8_Msk                      /*!< Standby GPIO retention enable for PB8  */
#define PWR_IORETENRB_EN9_Pos               (9UL)
#define PWR_IORETENRB_EN9_Msk               (0x1UL << PWR_IORETENRB_EN9_Pos)           /*!< 0x00000200 */
#define PWR_IORETENRB_EN9                   PWR_IORETENRB_EN9_Msk                      /*!< Standby GPIO retention enable for PB9  */
#define PWR_IORETENRB_EN10_Pos              (10UL)
#define PWR_IORETENRB_EN10_Msk              (0x1UL << PWR_IORETENRB_EN10_Pos)          /*!< 0x00000400 */
#define PWR_IORETENRB_EN10                  PWR_IORETENRB_EN10_Msk                     /*!< Standby GPIO retention enable for PB10 */
#define PWR_IORETENRB_EN11_Pos              (11UL)
#define PWR_IORETENRB_EN11_Msk              (0x1UL << PWR_IORETENRB_EN11_Pos)          /*!< 0x00000800 */
#define PWR_IORETENRB_EN11                  PWR_IORETENRB_EN11_Msk                     /*!< Standby GPIO retention enable for PB11 */
#define PWR_IORETENRB_EN12_Pos              (12UL)
#define PWR_IORETENRB_EN12_Msk              (0x1UL << PWR_IORETENRB_EN12_Pos)          /*!< 0x00001000 */
#define PWR_IORETENRB_EN12                  PWR_IORETENRB_EN12_Msk                     /*!< Standby GPIO retention enable for PB12 */
#define PWR_IORETENRB_EN13_Pos              (13UL)
#define PWR_IORETENRB_EN13_Msk              (0x1UL << PWR_IORETENRB_EN13_Pos)          /*!< 0x00002000 */
#define PWR_IORETENRB_EN13                  PWR_IORETENRB_EN13_Msk                     /*!< Standby GPIO retention enable for PB13 */
#define PWR_IORETENRB_EN14_Pos              (14UL)
#define PWR_IORETENRB_EN14_Msk              (0x1UL << PWR_IORETENRB_EN14_Pos)          /*!< 0x00004000 */
#define PWR_IORETENRB_EN14                  PWR_IORETENRB_EN14_Msk                     /*!< Standby GPIO retention enable for PB14 */
#define PWR_IORETENRB_EN15_Pos              (15UL)
#define PWR_IORETENRB_EN15_Msk              (0x1UL << PWR_IORETENRB_EN15_Pos)          /*!< 0x00008000 */
#define PWR_IORETENRB_EN15                  PWR_IORETENRB_EN15_Msk                     /*!< Standby GPIO retention enable for PB15 */

